In [5]:
import pandas as pd

In [27]:
# EX 1.1 Create a DataFrame named student_data with columns: Name, Age,Gender, Score.
df=pd.DataFrame({'Name':['Alice','Bob','Charlie','David','Eva'],'Age': [23, 25, 22, 24, 23],'Gender': ['F','M','M', 'M','F'],'Score': [85, 78, 92, 70, 88]})
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [29]:
#Display the first three rows.
df.loc[0:2]

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92

In [31]:
#Filter out and display the rows where Gender is F
df[df['Gender']=='F']

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [33]:
#Add two columns Score1,Score2 which duplicates the Score column
df['Score1']=df['Score']
df['Score2']=df['Score']
df

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [35]:
#Add a column Age1 which duplicates the Age column
df['Age1']=df['Age']
df

      Name  Age Gender  Score  Score1  Score2  Age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [37]:
#Drop the Age1 column
df.drop('Age1',axis=1,inplace=True)
df

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [39]:
#Drop the Score1 and Score2 columns
df.drop(columns=['Score1','Score2'],axis=1,inplace=True)
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [41]:
#Drop the row ai index 3
df.drop(3,axis=0)
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [43]:
#Filter out and display the rows where &#39;Gender&#39; is F and ‘Score’ is greater than 85.
df[(df['Gender']=='F') & (df['Score']>85)]

  Name  Age Gender  Score
4  Eva   23      F     88

In [45]:
#Sort the DataFrame based on the &#39;Score&#39; column in descending order.
df.sort_values(by=['Score'],ascending=False)

      Name  Age Gender  Score
2  Charlie   22      M     92
4      Eva   23      F     88
0    Alice   23      F     85
1      Bob   25      M     78
3    David   24      M     70

In [47]:
#Add a new column &#39;Grade&#39; based on the Score with the following criteria:
#A for Score >= 90, B for 80 <= Score < 90,C for 70 <= Score < 80,D for Score <70.
def fillgrade(s):
    if(s>=90):
        return 'A'
    elif(s<90 and s>=80):
        return 'B'
    elif(s<80 and s>=70):
        return 'C'
    else:
        return 'D'
df['Grade']=df['Score'].apply(fillgrade)

In [49]:
df

      Name  Age Gender  Score Grade
0    Alice   23      F     85     B
1      Bob   25      M     78     C
2  Charlie   22      M     92     A
3    David   24      M     70     C
4      Eva   23      F     88     B

In [ ]:
# EX 1.2 Create a DataFrame sales_data with columns Month,Product,Sales, perform the following operations:

In [51]:
sales_data=pd.DataFrame({'Month':['Jan', 'Feb', 'Mar','Jan','Feb','Mar'],'Product':['A','A','A','B','B','B'],'Sales':[150, 200, 250, 300, 400, 500]})
sales_data

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [49]:
#Group the data by Product and calculate the total Sales for each product.
df1=sales_data.groupby('Product')['Sales'].sum()
df1

Product
A     600
B    1200
Name: Sales, dtype: int64

In [63]:
#Find the month with the highest sales for each product.
sales_data.loc[sales_data.groupby('Product')['Month'].idxmax()]

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [43]:
#Add a new column Sales_Percentage which represents the percentage contribution of each sale to the total sales of that product.
sales_data['Sales_Percentage']=(sales_data['Sales']/sales_data['Sales'].sum())*100
sales_data

  Month Product  Sales  Sales_Percentage
0   Jan       A    150          8.333333
1   Feb       A    200         11.111111
2   Mar       A    250         13.888889
3   Jan       B    300         16.666667
4   Feb       B    400         22.222222
5   Mar       B    500         27.777778

In [ ]:
'''EX 1.3 Create a DataFrame employee_data with the following data:
Name: John, Doe,Jane,Anna,Smith]
Department: [HR,Finance, None, IT,HR]
Salary: [50000, 60000, 55000, None, 58000]'''

In [29]:
employee_data=pd.DataFrame({'Name':['John','Doe','Jane','Anna','Smith'],'Department':['HR','Finance',None,'IT','HR'],'Salary':[50000, 60000, 55000, None, 58000]})
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [31]:
#Identify and count the number of missing values in each column.
employee_data.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [79]:
#Fill the missing values in the Department column with the mode of the column.
employee_data['Department']=employee_data['Department'].fillna(employee_data['Department'].mode()[0])
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [69]:
#Fill the missing values in the Salary column with the mean of the column.
employee_data['Salary']=employee_data['Salary'].fillna(employee_data['Salary'].mean())
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [71]:
#Drop any rows that still contain missing values.
employee_data=employee_data.dropna()
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [85]:
# EX 1.4 Create a Series temperature with the following data:
#[23, 21, 20, 25, 27, 30, 28, 22, 24, 26]
temperature=pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temperature

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [ ]:
#Calculate the mean, median, and standard deviation of the series.

In [87]:
temperature.mean()

24.6

In [89]:
temperature.median()

24.5

In [91]:
temperature.std()

3.204163957519444

In [113]:
#Create a new Series temperature_celsius that converts the temperature from Fahrenheit to Celsius
temperature_celsius=pd.Series((temperature-32)*5/9)
temperature_celsius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [ ]:
#Find the index of the maximum and minimum values in the original temperature series.

In [99]:
temperature.idxmin()

2

In [101]:
temperature.idxmax()

5

In [105]:
#Sort the Series in ascending and descending order.
temperature.sort_values()

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [107]:
temperature.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [ ]:
# EX 1.5 Merging DataFrames

In [7]:
orders=pd.DataFrame({'OrderId':[1,2,3,4,5],'CustomerID':[101,102,103,104,101],'Product':['A','B','A','C','B']})
orders

   OrderId  CustomerID Product
0        1         101       A
1        2         102       B
2        3         103       A
3        4         104       C
4        5         101       B

In [15]:
customers=pd.DataFrame({'CustomerID':[101,102,103,104],'Name':['Alice','Bob','Charlie','David'],'Location':['New York','Los Angeles','Chicago','Houston']})
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [23]:
#1. Merge the orders and customers DataFrames on the &#39;CustomerID&#39; column.
#2. Display the merged DataFrame.
df_merged=pd.merge(customers,orders,on='CustomerID')
df_merged

   CustomerID     Name     Location  OrderId Product
0         101    Alice     New York        1       A
1         101    Alice     New York        5       B
2         102      Bob  Los Angeles        2       B
3         103  Charlie      Chicago        3       A
4         104    David      Houston        4       C

In [25]:
#3. Group the merged DataFrame by Location and calculate the total number of orders from each location.
df_merged.groupby('Location')['OrderId'].count()

Location
Chicago        1
Houston        1
Los Angeles    1
New York       2
Name: OrderId, dtype: int64